tutorials/DLBFoam-Hydrogen-Tutorials/2D_planar_flame/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

#include "planarMappingDict"

#include "readInletValue.H";
#include "readInternalScalarField.H"

internalField nonuniform $internalScalarField;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $inletValue;
    }

    outlet
    {
        type            zeroGradient;
    }

    "top|bottom"
    {
        type cyclic;

    }

    empty
    {
        type            empty;
    }
}

// ************************************************************************* //
