tutorials/DLBFoam-Hydrogen-Tutorials/2D_planar_flame/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistry       on;

initialChemicalTimeStep 1;

chemistryType
{
    solver          ode_pyJac;
    method          loadBalanced_pyJac;
}

odeCoeffs
{
    solver          seulex_LAPACK;
    absTol          1e-10;
    relTol          1e-5;
}

loadbalancing
{
    active          true;
    log             false;
}

refmapping
{
    active          false;
}

reactions {
}

// ************************************************************************* //
