tutorials/DLBFoam-Hydrogen-Tutorials/2D_planar_flame/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

Lx              0.08064;

Ly              0.08064;

Nx              2000;

Ny              2000;

W               #calc "$Lx / $Nx";

X0              0;

X1              $Lx;

Y0              0;

Y1              $Ly;

Z0              #calc "- $W / 2";

Z1              #calc "$W / 2";

vertices        ( ( $X0 $Y0 $Z0 ) ( $X0 $Y0 $Z1 ) ( $X1 $Y0 $Z0 ) ( $X1 $Y0 $Z1 ) ( $X0 $Y1 $Z0 ) ( $X0 $Y1 $Z1 ) ( $X1 $Y1 $Z0 ) ( $X1 $Y1 $Z1 ) );

blocks          ( hex ( 0 2 6 4 1 3 7 5 ) ( $Nx $Ny 1 ) simpleGrading ( 1 1 1 ) );

edges           ( );

boundary        ( inlet { type patch ; faces ( ( 0 1 5 4 ) ) ; } outlet { type patch ; faces ( ( 2 6 7 3 ) ) ; } top { type cyclic ; neighbourPatch bottom ; faces ( ( 4 5 7 6 ) ) ; } bottom { type cyclic ; neighbourPatch top ; faces ( ( 0 2 3 1 ) ) ; } empty { type empty ; faces ( ( 1 5 7 3 ) ( 0 4 6 2 ) ) ; } );

mergePatchPairs ( );


// ************************************************************************* //
